"use strict"
class RulesMega {
	constructor() {
	}
	static GetCountry(id) {
		let item = countries.find(item=> item.mega.indexOf(parseInt(id)) != -1);
		if (item) return item.base;
		else return "";
	}
	static Sex(id) {
		if ( id == 1 ) return 1;
		else return 2;
	}
	static DocClientType(id) {
		if ( id == 1 ) return 1;
		else return 2;
	}
	static AddrState(id) {
		for (let item of addrStates) {
			for (let s of item.mega) {
				if (s.toLowerCase() == id.toLowerCase()) return item.base;
			}
		}
		return "";
	}
	static Fs(id) {
		if (id == "True") return 1;
		else return 2;
	}
	static ProfileCode(id) {
		let item = profiles.find(item=> item.mega.indexOf(id) != -1);
		if (item) return item.base;
		return "";
	}
	static DocCategory(id) {
		if ( id == 1 ) return 1;
		else return 2;
	}
	static FizDocTypeOld(id) {
		let item = oldftypes.find(item=> item.mega.indexOf(id) != -1);
		if (item) return item.base;
		return "";
	}
	static FizDocTypeOldString(id) {
		let item = oldftypesString.find(item=> item.mega.indexOf(id) != -1);
		if (item) return item.base;
		return "";
	}
	static FizDocTypeNew(id) {
		let item = newftypes.find(item=> item.mega.indexOf(id) != -1);
		if (item) return item.base;
		return "";
	}
	static UserId(id) {
		let item = users.find(item=> item.mega.indexOf(id) != -1);
		if (item) return item.base;
		return "";
	}
}
module.exports = RulesMega;

let users = [
	{mega: ["admin"], base: "admin"},
	{mega: ["SYSTEM"], base: "SYSTEM"},
	{mega: ["9bb8170f8c6a5fe956984d6cbfc372e4"], base: "agapovicheva"},
	{mega: ["92837bdb344750760b336a37fa50263e"], base: "kuznecova"},
	{mega: ["d8bb4885cbe1dc077fb6c2529a1e301a"], base: "shemota"},
	{mega: ["7dffa7d3a6677ff5005e4d77c5d5b3ae"], base: "savchenko"},
	{mega: ["85abdf2bd7f7e3b3cb13bd58e2aaf7ec"], base: "argashokova"},
	{mega: ["e1052687da86b1c0c5fa807c8b997e86"], base: "antushina"},
	{mega: ["1d848f20fb51f8f08e2fdd0d089bf742"], base: "arutunyan"},
	{mega: ["8b8938dc892ccbe32960984a321e05ca"], base: "barisheva"},
	{mega: ["11f68ad7356b0ce3ba823b00869b3d94"], base: "goncharenko"},
	{mega: ["3463406ca4aa934ebe32221c936bc066"], base: "grineva"},
	{mega: ["0e100a9a3798471ebad31300a4fce764"], base: "fursina"},
	{mega: ["ab7de45438cc2fb16116f97aaff41e00"], base: "bogdanova"},
	{mega: ["f454e29d2e24713d2b9c03b040ccd94e"], base: "marchenko"},
	{mega: ["183965cf2081394f85f67639597f3fa1"], base: "zubkova"},
	{mega: ["e9e3c5f1868b998e438c42a249289c29"], base: "zaiceva"},
	{mega: ["59f7429bdd7bf39dbcee824a2b2d4f64"], base: "krasnova"},
	{mega: ["3ae81cc938816038bd65b5afb944ea5a"], base: "sokolova"},
	{mega: ["d066a915eb00f00ba3bc299c7af94058"], base: "Operator"},
	{mega: ["3a468e70c8027a1fdb3ab92ddfc6b906"], base: "chromih"},
	{mega: ["a715ef1091be8c10faea226e70fd75d6"], base: "Laipanova"},
	{mega: ["6f5cfede7a2f303c6828762cc39f58dd"], base: "luganskaya"},
	{mega: ["00003f7f51c8eaab7ecc7ddf7d384a5c"], base: "kadjayants"},
	{mega: ["89d85e3078ede809908528ddb651f06c"], base: "sindyanova"},
	{mega: ["2fcb25aa42b00a91f4e455e288ba6579"], base: "khachaturyan"},
	{mega: ["ca6c50f72ca305a232cc1a4c9f50eee8"], base: "bisraeva"},
	{mega: ["12b583981d8fa6bb8e4a44e1b57436f6"], base: "vartanyan"},
	{mega: ["3b4eb5ae9176e515a0053db14355d7ef"], base: "ermakova"},
	{mega: ["1e2e02d626ab756b7c4cbfd2fea6fb37"], base: "besshkurova"},
	{mega: ["476101eb1d4111b02ba70252f33898a8"], base: "feneva"},
	{mega: ["c099ae1c932711a88111268b61236ec3"], base: "alina"},
	{mega: ["50634d0846664dc7ccc807c9aa3e857c"], base: "kolesnikova"},
	{mega: ["6055cea2e9ca2c173a6dd0fc38b5d607"], base: "stajer1"},
	{mega: ["11c64f0afc34b85e9214361b53496ab0"], base: "polnikova"},
	{mega: ["533db4cfacd871348ec9830b13e988e8"], base: "stajer2"},
	{mega: ["cb04d8db681fc2f4de1926c86f99f4e0"], base: "kalmykova"},
	{mega: ["f6a924389d8bcbfd6a33eefa03e2a322"], base: "shmavonyan"},
	{mega: ["92ac5fbfd67205e1ebda642b54aabde5"], base: "braterskaya"},
	{mega: ["952715aae4fc90656d960ba3e8026727"], base: "nikiforova"},
]

let countries = [
	{mega: [1,293,567], base: 235},
	{mega: [232], base: 49},
	{mega: [174], base: 233},
	{mega: [124], base: 63},
	{mega: [71], base: 231},
	{mega: [175], base: 236},
	{mega: [242], base: 36},
	{mega: [240], base: 60},
	{mega: [165], base: 42},
	{mega: [108], base: 63},
	{mega: [237], base: 75},
	{mega: [32], base: 234},
	{mega: [208], base: 126},
	{mega: [125], base: 103},
	{mega: [176], base: 127},


	{mega: [653,249,100], base: -1},
]

let oldftypes = [
	{mega: [8], base: 4}, //Вид на жительство
	{mega: [3], base: 3}, //Военный билет
	{mega: [0], base: 14}, //Не определен
	{mega: [4], base: 12}, //Офицерское удостоверение
	{mega: [1,759220,429660,8207,6,5], base: 1}, //Паспорт
	{mega: [2], base: 5}, //Паспорт заграничный
	{mega: [22], base: 2},//Паспорт иностранный
	{mega: [7], base: 17}, //Свидетельство о рождении
	{mega: [24], base: 18},//Справка об освобождении
]
let oldftypesString = [
	// {mega: [8], base: 4}, //Вид на жительство
	// {mega: [3], base: 3}, //Военный билет
	{mega: ["Другой документ","другой документ","Дд","ДРугой документ"], base: 14}, //Не определен
	// {mega: [4], base: 12}, //Офицерское удостоверение
	{mega: ["Паспорт","паспорт",","], base: 1}, //Паспорт
	// {mega: [2], base: 5}, //Паспорт заграничный
	{mega: ["Инностранный паспорт","Ин","До"], base: 2},//Паспорт иностранный
	// {mega: [7], base: 17}, //Свидетельство о рождении
	// {mega: [24], base: 18},//Справка об освобождении
]
let newftypes = [
	{mega: [8], base: 4}, //Вид на жительство
	{mega: [3], base: 3}, //Военный билет
	{mega: [0], base: 14}, //Не определен
	{mega: [1], base: 1}, //Паспорт
	{mega: [104,22], base: 2},//Паспорт иностранный
	{mega: [7], base: 17}, //Свидетельство о рождении
	{mega: [24], base: 18},//Справка об освобождении
	{mega: [100], base: 7},//Временное удостов. личности
	{mega: [106], base: 7},//Иностр. паспорт моряка
	{mega: [103], base: 3},//Паспорт моряка
	{mega: [102], base: 19},//Паспорт СССР
	{mega: [101], base: 6},//Разреш. на врем. проживание
	{mega: [108], base: 10},//Св-во о предостав убежища в РФ
	{mega: [107], base: 11},//Св-во о рассм. приз. беженцем
	{mega: [105], base: 13},//Удостоверение беженца
	{mega: [4], base: -1},//Удостоверение беженца
]

let profiles = [
	{mega: ["ofis_kbr","ofis kbr"], base: 1},
	{mega: ["ofis"], base: 2},
	{mega: ["ofis_khr"], base: 3},
	{mega: ["ofis_sk_new"], base: 4},
	{mega: ["pyat3"], base: 5},
	{mega: ["pyat2"], base: 6},
	{mega: ["kara3"], base: 7},
	{mega: ["kara4"], base: 8},
	{mega: ["green_dots_bogatyreva"], base: 9},
	{mega: ["green_dots_sk"], base: 10},
	{mega: ["green_dots_kbr"], base: 11},
	{mega: ["green_dots_kcr"], base: 12},
	{mega: ["fst_kbr"], base: 13},
	{mega: ["pyat"], base: 14},
	{mega: ["kara"], base: 15},
	{mega: ["kara2"], base: 16},
	{mega: ["zaharova"], base: 17},
]

let addrStates = [
	{mega: ["Ставропольский край ","Ставропльский Край","Ставропольский край","Ставропольский","Ставропольский кр.","СК","Старопольский край","Ск","Ставропольский  край","Старопольский Край","Ставрапольский край","Ставропольский Край","Ставррпольский Край","Ставроппольский край","Ставропольский край","Ставропольский икрай","Ставропольский  крайа","Ставропольский  край3","Ставропольский  край","Ставропольский","Ставропольсий Край","Ставрополький Край","Ставрополький","Ставропльский Край","Ставропльский","Ставрапольский Край","ставпольский край","Ставропольский  край ","Ставропльский край","Ставропольсий край","Ставрополький край","Ставроопольский край","Ставроп.край","ск","Ствропольский край","Старопольский","Смт","Ставропольскому","Ставропольсктй край","ставропльский край","Мин-воды","Левокумский","Левокумский","са","СТАВРОПОЛЬСКИЙ КРАЙ","Ст","ставропольский","Ставропольская","Ставропльская","Ставропольскаий край","ставропольский край","георгиевский","Ставр,","Савропольский","Ставропоьский","Ставроаольский","Ставрпольский","Ставрпольский край","Ставрополський","С.К","Аджиевский","Солнечнодольск,пгт","Красный Пахарь,с","Салоно-Дмитриевское","Ставропол","Ставропольский ерай","Старопольский крайт","Старопольский край3","СТаропольский край","ставропольский  край","ск ","с к","ставропольский крайт","ставропольский край,","ск.","ставропольский край,","сттаропольский край","ставроапольский край","ставсропольский край","ставроппльский край","ставропольский ","ставпоольский край","ставпоольский","ставропольсий край,,,,,,","ставропольский кра","ставропольсий кра","ставрополький край ","буденновский р"], base: 26},
	{mega: ["Симферополь"], base: 84},
	{mega: ["Кбр","Кабрадино-балкарская республика","Кабардино-балкарская республик","Кабардино-балкария", "Кабардино-Балкарская Республика", "Кабарадино-балкарская республика","Кабардино-Балкария","КБР","Кабарадино-Балкарская Республика","Кабардино-Балкарская республикая","Кабардино-Балкарская республика","Кабардино-балкарская республика","Кабардино-Балкасркая Республика","Кабардино-Балкарскя Республика","Кабардино-Балкарская Республикая3","Кабардино-Балкарская Республикая","Кабардино-Балкарская республикаа","Кабардино-балкарская республика","Кабардино-балкарская республик","Кабардино-балкария","Кабардино-Балкарcкая Республика","Кабардино- Балкарская Республика","Кабардино Балкарская Республика","Кабардино -Балкарская Республика","Кабардинj-Балкарская Республика","Кабараино-балкарская республика","Кабарадино-балкарская республика","Кабардино-балкарская республикаа","Кабардино-балкарская Республика","Кабардино-балкарcкая Республика","Кабардино-Балкарскя республика","Кабаадино-балкарская республика","Кабардино-балкарская","Кабардино Балкарская","Респ.КБР","Кабардино Балкария","КБё","кбр","Кабардино-Балкарская респ","Республика Кабардино-Балкария","кабардино-балкарская республика","кБР","Терскол,с","Ново-Полтавское,с","Аушегер","Тырнауз","Нейтрино,с","Быллым,с","КАбардино-балкария","Нальчик. КБР","кабардино-балкария","Кабардино-балкарская республика,","Нальчик. кбр","Кабардино-Балкарская Республикаъ","кабарадино-Балкарская Республика","кабарадино-балкарская республика","респ. кабардино-балкария","кабардинкабао-балкарская республика","кабрдино-балкарская республика","кабарино-балкарская республика","кабардино-балкарская республикая "], base: 7},
	{mega: ["Карачаево-Черкесской республике","Карачаево- черкесская республика","Карачаево-Черкесская республик","Кчр","Карачаево-Черкесская республика","КЧР","Карачаево-черкесская республика","Карачаева-черскесская республика","Карачаева-черкесская республика","Карачаево-Черскесская республика","Карачаево - Черкесская республика","Карачаево-черскесская республика","Карачаево - Черкесская республика,","Караъ","Карачаеоа-черскесская республика","Карачаео-Черкесская республика","Карачаевочеркесская республика","Карачаево-ческесская республика","Карачаево-Черскесская республика","Карачаево-Черкесская республикка","Карачаево-Черкесская республиква","Карачаево-черкесская республика4","Карачаево-Черкесская республика,","Карачаево-Черкесская республика+","Карачаево-Черкесская республика","Карачаево-Черкесская республик,","Карачаево-Черкесская республик","Карачаево-Черкесская республиа","Карачаево-Черкесская","Карачаево-черкессия","Карачаево- черкесская республикаа","Карачаево- черкесская республика","Карачаево- черкесская республик","Карачаево черкесская республика","Карачаево -Черкесская республика","Карачаево - Черкесская республико","Карачаево - Черкесская республикка","Карачаево - Черкесская республика,","Карачаево - Черкесская республика","Карачаево - Черкесская республик,","Карачаево - Черкесская республик","Карачаевао-черскесская республика","Карачаевао-черкесская республика","Карачаева-черскесская республика","Карачаева-черскесская республ","Карачаева-черкесская республика","Карачаев-черскесская республика","Карачаев-черкесская республика","Карачаева-Черкесская республика","Карачаево - Черкесская Республика","Карачаево- Черкесская республика","Карачево-Черкесская республика","Карачаево-Черкесская Республика","Карачаева-черскесская Республика","Карачаево-черкесская Республика","Карачаево-черкесская Республика","Карачаево-черкесская Республика","Карачаево-Черкесская республикА","Карачаево- Черкесская Республика","Карачаево-черкесская","Карвчаева черкесская республика","Карвчаева черкесская республика","Карачаево-Черкессия","Респ.КЧР","кчр","Республика КЧР","Карачаевск-черкесской","Карачаево-черкесск","Кызыл-Покун,с","Псыж,аул","Кизил-Тогай","КчР","Архыз,с","Кч","КРЧ","Кчр ","Малокарачаевский","КЧр","КЧР,","КЧР ","КЧРП","Карачаево-черкесия","КАРАчаева-черскесская республика","кЧР","карачаева-черскесская республика","КараЧаева-черскесская республика","КАрачаева-черскесская республика","КАРАЧаева-черскесская республика","КАРачаева-черскесская республика","КАРАчаево-черкесия","Карачаева-Черскесская республика","карачаево-черкесския","карачаеоа-черкесская республика","карачаевоа-черскесская республика","карачаеваочеркесская республика","карачъ"], base: 9},
	{mega: ["Дагестан Республика","Дагестан", "Дагестан республика","Республика Дагестан","Республика дагестан","Республика  Дагестан","Республика Дагестан","Республика  Дагестан","Р.Дагестан, с.Цветковка","Р.Дагестан, с.Ново Хушет","Р.Дагестан, с.Кули","Р.Дагестан, с.Каякент","Р.Дагестан С.Сергокала","Р.Дагестан","Дагестан Республика","Дагестан респ.","Дагестан","республика  Дагестан","дагастанская респ","респ.Дагестан","Дагестанская р-ка","Дербентский","Дегстан","данестан","р. Дагестан","дагне","респ. Дагестан","Респ.Дагестан","дагестан","Респ.дагестан","Дагестана","республика дагестан","республика Дагестан","Дагестнаская","дагЕстанская респ","Буйнакский","Дагетстан","Дагестанская респ","Респ Дагестан","Р.Дагестан,с.Курах","Р.Дагестан, с.Чиркей","Р.Дагестан, с.Калинина","Р.Дагестан, с.Кафыр-Кумух","Р.Дагестан,с.Нижний Дженгутай","Р.Дагестан, п.Шамхал","Р.Дагестан, с.Аркас","Р.Дагестан,с.Ерси","Р.Дагестан, с.Богатыревка","Р.Дагестан, с.Красноармейск","Р.Дагестан, п.Ленинкент","Р.Дагестан, с.Боташюрт","Р.Дагестан, п.Шамхалтермен","Р.Дагестан, п.Нов.Хушет","Калинипаул","Р.Дагестан, с.Карата","Р.Дагестан, п.Новый Чечень","Р.Дагестан, с.Леваши","Р.Дагестан, с.Шамилькала","Р.Дагестан, с.Буглен","Р.Дагестан, с.Атланаул","Р.Дагестан, с.Ишкарты","Р.Дагестан, с.Верхнее Казанище","Р.Дагестан, с.Карамахи","Р.Дагестан, с.Цудахар","Р.Дагестан, п.Загородный","Р.Дагестан, п.Глав Сулак","Р.Дагестан, п.Новый Кяхулай","Р.Дагестан, с.Халимбекаул","Р.Дагестан, с.Дуранги","Р.Дагестан, с.Кадар","Р.Дагестан, с.Герей Авлак","Р.Дагестан, г.Южно-сухокумск","Р.Дагестан, с.Верхний Дженгутай","Р.Дагестан, с.Акабтала","Р.Дагестан, с.Верхний Каранай","Р.Дагестан. с.Кафыр-Кумух","Р.Дагестан, с.Акайтила","Р.Дагестан, с.Бабаюрт","Р.Дагестан, с.Нижний Казанище","Р.Дагестан, с.Апши","Р.Дагестан, с.Кафыр-кумух","Р.Дагестан, с.Аргвани","Р.Дагестан, с.Нижний Дженгутай","Р.Дагестан, с.Нижнее Казанище","Р.Дагестан, п.Альбуркент","Р.Дагестан, с.Тлондода","Р.Дагестан, с.Губден","Р.Дагестан, п.Нов.Кяхулай","Р.Дагестан, с.Шамхал-Термен","Р.Дагестан, с.Ботлих","Р.Дагестан, с.Шамхалтермен","Р.Дагестан п.Красноармейск","Р.Дагестан с.Дзержинское","Р.Дагестан с.Уллубийаул","Р.Дагестан с.Кулесу","Р.Дагестан с.Атланаул","Р.Дагестан с.Карамахи","Р.Дагестан с.Новолакское","Р.Дагестан с.Нижний Казанище","Р.Дагестан С.Нижний Дженгутай","Р.Дагестан с.Кафыр-Кумух","Р.Дагестан с.Ерси","Р.Дагестан п.Шамхал-Термен","Р.Дагестан п.Ленинкент","Р.Дагестан с.Маджалис","Р.Дагестан с.Аркас","Р.Дагестан п.Глав Сулак","Р.Дагестан с.Богатыревка","Р.Дагестан п.Шамхал","Р.Дагестан с.Чанкурбе","Р.Дагестан с.Манасаул","Р.Дагестан с.Дуранги","Р.Дагестан с.Халимбекаул","Р.Дагестан с.Буглен","Р.Дагестан п.Ново Тарки","Р.Дагестан с.Апши","Р.Дагестан с.Верхнее Казанище","Р.Дагестан с.Верхний Каранай","Р.Дагестан с.Нижний Дженгутай","Р.Дагестан с.Кафыркумух","Р.Дагестан с.Эрпели","Р.Дагестан с.Чиркей","Р.Дагестан, с.Ново Испик","Р.Дагестан, с.Карабудахкент","Р.Дагестан, с.Верхние Мулебки","Р.Дагестан, с.Куяда","Р.Дагестан с.Шамилькала","Р.Дагестан с.Карабудахкент","Р.Дагестан с.Миатли","Р.Дагестан с.Бредихин","Дагестан с.Халимбекаул","Дагестан с.Верхнее Казанище","Дагестан с.Леваши","Дагестан с.Буртунай","Дагестан с.Карамахи","Дагестан п.Шамхал","Дагестан с.Акайтыла","Дагестан с.Кафыр-кумух","Дагестан с.Хартикуни","Дагестан с.Трисанчи","Дагестан с.Худутль","Дагестан с.Ново Терек","Р.Дагестан с.Нечаевка","РД","ДАГЕСТАН","республика дагестан "], base: 5},
	{mega: ["Ростовская область","Ростовская обл.","Ростовская","Ростовская Обл","Росо","ростовская","Ростовская обл","Ростовская ","РОСТОвская область","ростовская область","роствская область"], base: 61},
	{mega: ["Иркутская область","Иркутская","Иркутсукая","иркутская","иркутская обл.","Бирюгинск","иркутская "], base: 38},
	{mega: ["Республика Адыгея","Адыгея","республика адыгея","Респ.адыгея","Майкоп","адыгея республика"], base: 1},
	{mega: ["Тюменская область","Тюменская обл.","Тюменская","тюменская","Тюменьская область","тюменская "], base: 72},
	{mega: ["Республика мордовия","Саранская"], base: 13},
	{mega: ["Астраханская область","Астраханская обл.","Астраханская","астраханская","Астраханчкая","Астра","Астраханская "], base: 30},
	{mega: ["ХМАО","Ханты-Мансийский автономный округ","Ханты-Мансийский автономный округ-Югра","ХМАО-ЮГРА","Ханты-Мансийский АО","Ханты Мансийский АО","Хмао","Ханты мансийский автономный округ","Ханты-Мансийский округ","ХантыМансийский АО","ханты-мансийская","Ханты мансийский ао","ханты-мансийский АО","Ханты-мансийский ао","Ханты-мансийская","Ханты-мансийский округ","Ханты-Мансийск","Ханты-мансийск","Ханты-Мансийский АО г.Кагалым","Ханты-Мансийский а.о.","ханты-мансиийский ао","хмао ","ханты-мансийский ","ао ханты-мансийский"], base: 81},
	{mega: ["Самарская область","Самарская","самарская область","самар",], base: 63},
	{mega: ["Чеченская республика","Чеченская","Чеченская Республика","Чеченская респ.","Чеченская рка","чеченская республика","Чр","Чеченская рес.","Чеченская рес-ка","ЧР","чеченская","Чеченская респ","Чече","Чесенская","Грозный","Чечня","ЧЕченская Республика","чеченская р-ка"], base: 20},
	{mega: ["Белгородская область","Белгородская","Белогородская","белгородская","Белородская","Верхнее Кузькино,с","Белгородская обл","белгородская обл."], base: 31},
	{mega: ["Краснодарский край","Краснодарский","Краснодарский Край","Краснодарского","Кк","Крснодарский","краснодарский","Краснодарская","Каснодарский","Коаснодарский","Краснадарский","Красодарский","Адлер","КРаснодарский край","краснодарский край","Краснодар","Краснодарский  край","Краснодарский кр","краснодарский край,",], base: 23},
	{mega: ["Волгоградская область","Волгоградская","Волгоградская Область","Волгодская","Волгоградкая","Вогоградская","волгоградская","Среднеахтубинском р-не","Волгоградская, п.Калачевский","Волгоград","волградская"], base: 34},
	{mega: ["Удмуртская Республика","Республика Удмуртия","Республика удмуртия","республика Удмуртия","удмуртия","Удмуртская республика","Ижевская","Удмурская","Удмуртия","Удмурская респ","Удмуртская","Ижевская область"], base: 18},
	{mega: ["Псковская область","Псковская","псковская","Псовская"], base: 60},
	{mega: ["Республика САХА(Якутия)","Саха(Якутия)","Саха (Якутия)","Саха","Якутия","Саха якутия","Республика саха","якутская","Республика саха якутия","Айхал","Айхал,п","Саха (якутия) республика","Республика Саха","Р. Саха (Якутия)","С.якутия"], base: 14},
	{mega: ["Московская область","Московская","Московская Область","мосовская","московская","Москвовская","Мосовская","московская обл.","Московская  Область","Московская","Московская","Московская ","МОсковская область","московскя"], base: 50},
	{mega: ["Свердловская область"], base: 66},
	{mega: ["Свердловская область","Свердловская","Свердловкая","Екатеринбургская","екатеринбургская","свердловская","СВЕРДЛОВСКАЯ"], base: 66},
	{mega: ["Ленинградская область","Ленинградская","лениградская","Санкт-Петербургская","Леннградская","Санкт петербургская","СанктПетербургская","Лениградская","Ленин","Санкт-петербургская","ленинградская","ленинградская обл."], base: 47},
	{mega: ["Ивановская область","Ивановская","Иавновская","Иваноская"], base: 37},
	{mega: ["Республика Северная Осетия-Алания", "Северная Осетия-Алания","Северная Осетия-Алания Республика","Северная Осетия-алания Республика","Северная осетия-алания республика","Рсо","Северная Осетия Алания","Северная Осетия Олания","РСО-Алания","РСОАлания","РСО Алания","Республика северная осетия -алания","РСОА","Респ Северная Осетия","Алания","Осетия-Алания","Северная осетия","Респ.РСО-Алания","Рсо алания","Северная Осетия- Алания","Рсо-алания","Северная Осетия","Северная Осентия-Алания","северная осетия алания","Севро Осетия","Северная осетия алания","Северная Осентия","Республика северная осетия алания","республика Северная Осетия-Алания","Рсоа","северная-осетия-алания","республика Южная Осетия","Северная осетия- алания","РсО Алания","Северная Осетия - Алания","Северная-осетия","СОА","РсоА","рсо-а","севеоная осетия-алания","северная -осетия","республика северная осетия-алания "], base: 15},
	{mega: ["Республика калмыкия","Калмыкия","РЕСПУБЛИКА Калмыкия","республика Калмыкия","калмыкия","Респ.Калмыкия","Калмыкия республика","калмыкия респ.","респ. калмыкия","республика  калмыкия","республика  калмыкия",], base: 8},
	{mega: ["Челябинская область","Челябинская","Челябенская","челябинская ","челябинская облость","челябинская облость","челя",], base: 74},
	{mega: ["Республика Татарстан","РеспубликаТатарстан","Татарстан","Казань","ТАТАРСТАН","Респблика Татарстан","р. татарстан","татарстан респ"], base: 16},
	{mega: ["Воронежская область","Воронежская","Вооронежская","воронежская","воронежская область","воронежская обл."], base: 36},
	{mega: ["Республика Крым","Крым"], base: 84},
	{mega: ["Москва","Москова"], base: 77},
	{mega: ["Рязанская область","Рязанская","область рязанская",], base: 62},
	{mega: ["Оренбургская область","Оренбургская","Оренбурская","оренбургская","оренбурская","оренбургская "], base: 56},
	{mega: ["Ямало-Ненецкий АО ","Янао","ямало-ненецкий автономный округ","ЯНАО Тюменской","Ямало-Ненецкий АО","Ямало-Ненецкий","ямао","Ненецкий АО","Ямало-Ненецкий А,О","ненецкий автономный округ","Ямало- Ненецкий автономный округ","Ямало-ненецкий округ","ЯНОА Тюменская","ненецкая","ЯНОА Тюменская","Ямало-Ненецкий автономный округ<","Ямало-Ненецкий автономный округ","Ненецкий ао","Ямало-ненецкий ао","ЯНАО","Ямало-ненецкий",">ямало ненецкий АО","ямало ненецкий АО","Ямало-ненецкий а.о","Аксарка,с","ЯМАО","Ямало-ненецкий авт. окр.","Ямало-Ненцкому округу","ЯнАО","ЯнаО","ао ямало-ненецкий","ямало ненецкий автономный округ "], base: 83},
	{mega: ["Ярославская область","Ярославская"], base: 76},
	{mega: ["Красноярский край","Таймырский АО","Красноярская","Краноярский край","Красноярский","красноярская","Крсноярский","Красноярск"], base: 24},
	{mega: ["Саратовская область","Саратовская  область","Саратовская  область","Саратовская","Сарстовская область","балаковский р-н","саратовская","саратовская обл."], base: 64},
	{mega: ["Приморский край","Приморская","Приморский","Приморска"], base: 25},
	{mega: ["Кировская область","Кировская обл","Кировская"], base: 43},
	{mega: ["Тульская область","Тульская","Алёшня,д","тульская область"], base: 71},
	{mega: ["Новгородская область","новгородская","Новгородская","Новгородская","Великий Новгород,г","новгородская область"], base: 53},
	{mega: ["Пензенская область","пензнская","Пензенская","Пензинская","Пензнская","Пензская","Пензинская область","пензенская область"], base: 58},
	{mega: ["Архангельская область","Архангельская","архе","Красноборский","архангельская"], base: 29},
	{mega: ["Владимирская область","владимировская","владимирвская","Владимирская","Владимировская","Владимирской"], base: 33},
	{mega: ["Нижегородская область","Нижегородская","Нижнегородская","Нижегородская обл.","Нежегородская"], base: 52},
	{mega: ["Республика Ингушетия","Ингушетия","Ингушетия республика","Ингушетия Республика","Республика ингушетия","ингушетия","республика ингушетия","Инушетия","Респ.Ингушетия","ЧИАССР","Икажево","Ингушская республика"], base: 6},
	{mega: ["Липецкая область","липецкая","Липецкая","липенской"], base: 48},
	{mega: ["Кемеровская область","Кемеровская"], base: 42},
	{mega: ["Чувашская республика","Чувашская Республика","Чувашия","Чувашская респ.","Чувашская"], base: 21},
	{mega: ["Омская область","Омская","омская"], base: 55},
	{mega: ["Калужская область","Калужская","Клужская"], base: 40},
	{mega: ["Республика Башкортостан","Республика Башкорстан","Башкортостан","башкартостан","Башкирстан","Башкорстан","республика Башкортостан","респ. Башкортостан","Башкортостан ","Респ.Башкортостан","Башкирия","Уфа","башкортостан","Башкортостан респ.","Башкортостан республика","Башкортастан","Республика башкортостан"], base: 2},
	{mega: ["Тверская область","Тверская","тверская"], base: 69},
	{mega: ["Курская область","Курская","Куская","Курский","Курская обл."], base: 46},
	{mega: ["Пермский край","Пермская область","Пермская","Пермский","пермская","Перьмская область"], base: 59},
	{mega: ["Смоленская область","Смоленская","Смоленская обл"], base: 67},
	{mega: ["Республика Бурятия","Бурятия","Респ.Бурятия","Респ Бурятия","Бурятскоя","Р.Бурятия","Республика бурятия","бурятия республика"], base: 3},
	{mega: ["Орловская","Орловская область"], base: 57},
	{mega: ["Камчатский край","Камчатская","Комчатский АО","Камчатский","Комчатская","Петропавловск-комчатский","Камчатская область","камчатский "], base: 41},
	{mega: ["Республика Коми","Республика коми","Коми","Республика Коми ","Респ.коми","Коми пермяцкий ао","Коми республика","Респ, Коми","коми респ."], base: 11},
	{mega: ["Карелия","Республика карелия","Республика Карелия","карелия республика","респ.карелия",], base: 10},
	{mega: ["Республика Хакасия","Хакасия","Респ.хакасия"], base: 19},
	{mega: ["Тамбовская область","Тамбовская"], base: 68},
	{mega: ["Новосибирская область","Новосибирская","новосибирскя","Новосибирскоя","Новосибирск","Новосиьирская","Нвосибибирская"], base: 54},
	{mega: ["Калининградская область","Калининградская","Калининградсая","Калиниградская"], base: 39},
	{mega: ["Санкт-Петербург","Санкт петербург","Санкт-петербург","Санкт Петербург","Спб"], base: 78},
	{mega: ["Алтайский край","Алтай","Алтайский","алтайский край","алтайский","республика алтай"], base: 4},
	{mega: ["Мурманская область","Мурманская","Муромская"], base: 51},
	{mega: ["Томская область","Томская","томская"], base: 70},
	{mega: ["Брянская область","Брянская","Брянская","Брянская обл.","брянская","Бытошь,п"], base: 32},
	{mega: ["Ульяновская Область","Ульяновская область","ульяновский","Ульяновская","ульяновская"], base: 73},
	{mega: ["Еврейская Автономная область","Еврейская ао","еврейская","Еврейская"], base: 79},
	{mega: ["Амурская область","Амурская","Магдагачи,пгт","Амурская "], base: 28},
	{mega: ["Вологодская область","Вологодская","Вологоградская","вологодская обл.","володогодская область","володогодская область",], base: 35},
	{mega: ["Забайкальский край","Забайкальский край "], base: 75},
	{mega: ["Мордовия","Республика Мордовия","респ. Мордовия"], base: 13},
	{mega: ["Курганская область","Курганная","Курганская","Курганский","Курганинская"], base: 45},
	{mega: ["Донецкая республика","донецкая народная республика",], base: 86},
	{mega: ["Магаданская область","Магаданская обл","Магаданская","магаданская"], base: 49},
	{mega: ["Костромская область","Костромская","Косторомская"], base: 44},
	{mega: ["Хабаровский край","Хабаровская","Хабаровский"], base: 27},
	{mega: ["Читинская область","Читинская","Читинская  "], base: 87},
	{mega: ["Сахалинская обл","Сахалинская","Сахалинская область"], base: 65},
	{mega: ["Марий Эл","Республика Марий Эл","Марий эл","Республика марий эл","респ. марий эл"], base: 12},
	{mega: ["Коми-Пермяцкий автономный округ","КПАО","Коми Пермяцкий АО","пермский кр"], base: 88},
	{mega: ["Чукотский ао","Чукотская","Чукотский Автономный Округ","Чукотка","Чукотский","чукотский АО","Чукотский АО","чукотский ао","чукотская ао"], base: 82},
	{mega: ["респ. Тыва","Тыва","Тыва республика","Республика Тыва"], base: 17},
	{mega: ["Эвенкийский ао","Эвенкийский АО","Эвенкийский"], base: 89},
	{mega: ["г. Севастополь","Севастополь"], base: 85},
	{mega: [",","Й","Абхазия","Казахстан","Нет","Одесская","витебская","Россия","си","Си","Черновицкая","Беларусия","Ссс","С т","Уч","Минская","Украинская","нет","С","Ульяновский","Подольская","Новопокровский","Железногорский","3","211206","Мешевой","Подлиное","Комсомолец,пгт","Сорочий пост","Поповка (Раменский с/о),д","Учхоз ЗВТ,п","Кольск","Дружба ст","Калининец,рп","острогорка","Ново-Ивановская,д","Подгорная","Корнетова","старокувинский","Ново-Покровский,п","Аргония,снт","Ново-Покровский,п","Аахынык,м","Бердуковский","Яр-сале","Универсальный","Первомайское","Мирный","Новосидоровка","Берд-Юрт,с","Восход","Плиево,с","Ново-Исправненский","малинки","Горокоп","Беркакит,п","Отсрогорка","горминка","-","Белоглинское,с","Турксад,с","Важная,д","Мыс-Каменный,с","Плесенец","Верхний Баскунчак,п","Черкесиха,снт","Нижний Куранах,п","Аршан-Булг,п","Винсовхоз","Атллово","Анджиевского","Приозовское","Старатарский","Терская","Чука,снт","Просвет,с","Битурлиновка","Григорова,д","Кайсула","Нижнебалковский,п","Мчулек","Ачерешки","Комаричи,п","Уйсалган","Хайли-Ирзи","Каминоломни","Старокувинск","Догээ-Баары,м","Шобекино","Большие Цары","Старокувинский","Эрхава","Алчевск","Шувое,п","Очинеры","Усть-Джегутинка,х","Джага,с","Арара-Тугел","Соло-Духовка","Фряново,рп","Альпийский","Греханово","Средний Хутор,п","Шалушка","Кавка","Казаневичево","Русское","Новый Кяхулай","Касагу","Новоматериковская","Береза,п","Алерой","Геримханово","Вятско-полянск","Шилов-Лесной","Паск Деменск","Каменносбойное","Урупское,снт","Агшу","Причертышский","Балебам-байшево","Мехельба","Чанкуова","Д. городух","Баровенка","Чалдовар","Марицыно,д","Новый-Костек","Тарабудахкент","Сахалинские зори,снт","Термахи","Кара тюбе","Нижний серги 3","Кулиртау","Канделакша","Чотрайский","Нижняя шиловка,с","Свень-Транспортная,п","Моногорск","Ногамерзин-Юрт","Огнинск","Матвеево-Курганск","Большое Алексеевское","Фруктовый,п","Олман юрт","Ново-хумаринский","4 километр","Ашахент","Джайрак","Каменогорье","Славяновский","Гирный","Елизоветовка","Хохловка","Белая Речка,п","Эбдалаинский","Минсурбе","Черняшке","Острогорка","Кызыл-тогай","Егорьевская","Волокновка","Тикси,п","Камнеболотская","Али-кую","Россошанский,п","Камой,д","Гой-чу,с","Дегтяровский","Эльдикан,п","Черский,п","Гамурзиевский МО,тер","Куба-Таба,с","Нестерево","Байдаево,с","Улан,с","Солнечнодольск,п","Верхне-сухокумск","Мехтеб","Дмитровград","Просковея","Цаган Аман,п","Гелижбекский","Аликановка","13 гаквари","Врязина","Хорошевский,х","Любимых","Кызыл-кала","Старая лиловая","Хасаной","Крем-константиновское","Капирказмаляр","Тували","Новая-бурня","Новый атаги","Шахаляши","индирей","Пушевка","С. русское","Хаясуло","Новый марой","Шиткала","новосреднее","Новоанинск","П. кристи","Костык","Новые ряды","Староанинская","Табиева","Логи,п","Свх Герейханова 1-й,п","Велера","Кенель","Нестеровское,с","Базарокарабулак","Бархат,снт","Нововикри","Альтиево,нп","Виневитиново,п","Кварунтный","Новых шарой","Хутун-Цохээ,м","чалдовар","Галошпе,с","Тюрего","Афинский","Хусса","Кызыл-Уруп","верхняя Чесночная","Среднеподкумский","Камсумкент","П.томинено","Чекистов","Нижнемулебки","Нижний Чегем,с","Управленческий,п","Мехзавод,п","Манычский,п","Хузрюк","Остерское","уйсалган","Топки","Курталой","Бурдимак","Васюковское","Кантемирова","Тингинка","Салиха","Кулацкий,х","Кенель-черкассы","Воршадемс","Малый Далинский","Сарское","Платиновская","Новобержаевка","Ботрак","Паротолово","Ногамизинюрт","Кизил-ногай","россам","Маго,п","Саранул","КК","Чокурдах,п","Нижнеалександровск","А.гюлюльдеук","Верхний Хавс","Цаган-аман","Мадежин","Султангиюрт","Андрей курган","Ново-Исправное","н-ляды","Кубинка-2","Толстоюрк","Большая Ейтовка","С.масловка","Микурлат","Фубка","Кишнек","Степное","Первомайский","Гограйский п","Гладков,п","Верхняя Чесночная","Тарск,п","Атырау","Ковгановский","Тонельный","Гудаута","П.Д.ЗФС","Кува-баши","Галханск","Любакин","Кормелкала","Парбанхи","Павло-посадск","Прохладненский","Индустрия","Нокоясенская","козгулак","Чульман,п","Малоабазинка","Всеволжск","Д.новое","Кутлой","Броницк","Старокуирпановка","Сеан-джегутай","Плаксийка","Кадиркент","Саулякны","Терезе,с","Нойбера","Зиинск","Кыншахтау","Каменоломнный","Салуно-Дмитриевское","Тамарил","Сертель-юрт","Кириленко","Банкин-юрт","Новогуртан","Лакха-невре","Аннинский","Дубавка","Нефтюганск","Вишневолоцкий","Дербентовка","Киево жураки","Старый оскол","С.н.стеблиевская","Узулук","Новобурасское","Будтвановка","Шентала","Нижняя Дубровенка,п","Тугулым,п/ст","Мачихино","Новоургаклинский","новая татарка","Коченевский","Сары-тюз","Гидири","Н. Товолжанки","Большое быково","Новозыбково","Носыр-корт","Растовская","Новые памяны","Псыучье-дахе","Далка","Ухучи","Госненский","К. Цеткин","Адигор","Куркужин","Железноводский","Малый барканчак","Лебедняск","Павлово-посад","Сохзавод","Салуно-дшар","Ново-исправненский","Подспальное","Улубий","Уньюган","Кубинская-10","Ульяновская ","Медведковская","Вознесение,с","Правопристольное","Раушинский","Кызыл кала","Хуса-Кардоникская","Шамрал Термен","Самовец","Ребкоров","Кызыл","Новый узень","Крапоткин","Тат парзи","Боготов","Кишлек","Курек","Горки-25,п","Нагинск","Х. Дачнива","Зато Северск","Перевозинское,с/п","Зункарский","Надтересный","Косицино,с","Билимбай,п","Закодычное","Илехан-юрт","Амди","кызыл","Агочаул","Пр.5600 м на юг от оринет","Ст.юцкая","Кулешма","Самбухова","Ровеньский","Кашры ","Кургульское","Карт-Джурт","Зеленый,с","Шагарамкент","Зато видяво","Кызыл-Покун","Полужский","Арзамасцевка,с","Выбычев","Славенск-на-кубани","Куба,с","Казаков","Малакановский","Кяр","Ново-мака","Усть-Курмыч","Кизыл-юрт","Кизлярский","Сергокалинск","Нижнекаменск","Зубчаниновка,п","Стекольное,ст","Аркани","С.Былым","Камменоломный","С.маскоб","С.ализя","Ст.кавказ","Тарни","безонш","Ст.Карпиган","с.костенак","Дерва","Псуа","Хуса-кардоник","Герейханова","Ново-хумаринск","С/з Мегионский","Южносухокумск","Ново-маныч","Старая Джегута","Выхино-жулебино","Безонш","Шардаково","РИ","Новокувинский","Керчь","Корложка","Нахрапкина балка","Елковка","Савинская Слобода","Герейхановское","с/совет","Джанкой","аглаби","Алимпашаюрт","Семинаракорск","Коклен","Нойбер","с. Кавка","Джепгутай","Винсады","Тыллык","Тюрюльдеук","Новый Малек","Ирим","Алтырь","Пстас","С. Маркса","С.Сапарское","Дмага","Серебряно-Прудский","Габцах","Линева","Бахун","Отрадно-Тегинский","Ванный городок 1","Новокувинск","Имкарты","Дмитриев","Наришкино","Неженка","Большой ток","Ст. ниднебокая-1","Десеновское","Назрановская","Краянское","Мичуринец-7","Новосаситли","ногалыча","Подскальный","с.богдановка","С.богдановка","х сунженский","С степное","х восточный","П.Белозерский","Лефортово","бишитюбинка","Березнин","С.хрячево","Ализе","Победнянский","Кхл. Ленина, МТФ-1","С(ОД)ПК Авиатор-34","Норушкиноское","Сейка","Гриш-10","Кадиркент,аул","Терновка","СК Винсады","ЧТ",'С(ОД)ПК "Авиатор-34"',"Кчп","Насыр-Корт","Краа","кк","Чк","Сек","су","крар","епоп","капра","ме","куара","ессенск","каар","еао","конаковский","эдиссия","нижегордский","левошинский","ска","росовская","к3","р","российская-федерация","степновский","халибек","савинская свобода","толлык","крукал",], base: -1},
]